# Taps
tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "facebook/fb"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "juliuscanute/formulae"
tap "mobile-dev-inc/tap"
tap "watr/formulae"
tap "wix/brew"
tap "xcodesorg/made"
tap "yt-dlp/taps"

# Binaries
brew "antigen"
brew "autojump"
brew "coreutils"
brew "folly"
brew "ffmpeg"
brew "git"
brew "handbrake"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "lazygit"
brew "lua-language-server"
brew "mint"
brew "neovim"
brew "node"
brew "postgresql@14"
brew "pyright"
brew "qrencode"
brew "redis", restart_service: true
brew "ripgrep"
brew "scrcpy"
brew "telnet"
brew "tmux"
brew "watchman"
brew "xclip"
brew "youtube-dl"
brew "aws/tap/aws-sam-cli"
brew "facebook/fb/idb-companion"
brew "github/gh/gh"
brew "heroku/brew/heroku"
brew "mobile-dev-inc/tap/maestro"
brew "wix/brew/applesimutils"
brew "xcodesorg/made/xcodes"

# Fonts
cask "font-hack-nerd-font"

# Apps
cask '1password'
cask 'android-studio'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'hiddenbar'
cask 'imageoptim'
cask 'pastebot'
cask 'raycast'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'spotify'
cask 'swiftformat-for-xcode'
cask 'xcodes'
cask 'miro'
