# Taps
tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "facebook/fb"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "juliuscanute/formulae"
tap "mobile-dev-inc/tap"
tap "watr/formulae"
tap "wix/brew"
tap "xcodesorg/made"
tap "yt-dlp/taps"

# Binaries
brew "antigen"
brew "autojump"
brew "coreutils"
brew "chruby"
brew "folly"
brew "ffmpeg"
brew "gh"
brew "git"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "node"
brew "postgresql@14"
brew "pure"
brew "qrencode"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby-install"
brew "scrcpy"
brew "telnet"
brew "tree"
brew "tmux"
brew "watchman"
brew "xclip"
brew "youtube-dl"
brew "zsh"
brew "facebook/fb/idb-companion"
brew "heroku/brew/heroku"
brew "mobile-dev-inc/tap/maestro"
brew "wix/brew/applesimutils"
brew "xcodesorg/made/xcodes"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-sf-pro"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-new-york"
cask "font-alegreya"
cask "font-alegreya-sans"

# Apps
cask 'android-studio'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'hiddenbar'
cask 'imageoptim'
cask 'iterm2'
cask 'keeper-password-manager'
cask 'logi-options-plus'
cask 'microsoft-teams'
cask 'pastebot'
cask 'rapidapi'
cask 'raycast'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'spotify'
cask 'swiftformat-for-xcode'
cask 'xcodes'

# Mac App Store
mas "Things 3", id: 904280696
